# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo..::..IsValid Method
FabricationConfigurationInfo Class See Also
---
Checks if the fabrication configuration is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if the fabrication configuration is valid.
# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace